SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_flash.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_flash.c
*\*\author Nations
*\*\version v1.0.1
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/
#include "n32g430_flash.h"

/** FLASH Driving Functions Declaration **/

/**
*\*\name    FLASH_Latency_Set
*\*\fun     Sets the code latency value.
*\*\note    This function can be used for N32G430 devices.
*\*\param   flash_latency :
*\*\            - FLASH_LATENCY_0    FLASH Zero Latency cycle, 0 < HCLK <= 32MHz      
*\*\            - FLASH_LATENCY_1    FLASH One Latency cycle, 32MHz < HCLK<= 64MHz
*\*\            - FLASH_LATENCY_2    FLASH Two Latency cycles, 64MHz < HCLK<= 96MHz
*\*\            - FLASH_LATENCY_3    FLASH Three Latency cycles, 96MHz < HCLK
*\*\return  none
**/
void FLASH_Latency_Set(uint32_t flash_latency)
{
    uint32_t temp_value = 0;

    /* Read the AC register */
    temp_value = FLASH->AC;

    /* Sets the Latency value */
    temp_value &= (~FLASH_LATENCY_MASK);
    temp_value |= flash_latency;

    /* Write the AC register */
    FLASH->AC = temp_value;
}

/**
*\*\name    FLASH_Latency_Get
*\*\fun     Get the code latency value.
*\*\note    This function can be used for N32G430 devices.
*\*\param   none
*\*\return  FLASH_LATENCY :
*\*\            - FLASH_LATENCY_0    FLASH Zero Latency cycle, 0 < HCLK <= 32MHz      
*\*\            - FLASH_LATENCY_1    FLASH One Latency cycle, 32MHz < HCLK<= 64MHz
*\*\            - FLASH_LATENCY_2    FLASH Two Latency cycles, 64MHz < HCLK<= 96MHz
*\*\            - FLASH_LATENCY_3    FLASH Three Latency cycles, 96MHz < HCLK
**/
uint8_t FLASH_Latency_Get(void)
{
    /* Read the AC register */
    return (uint8_t)(FLASH->AC & FLASH_LATENCY_MASK);
}

/**
*\*\name    FLASH_Prefetch_Buffer_Enable
*\*\fun     Enables the Prefetch Buffer.
*\*\note    This function can be used for N32G430 devices. 
*\*\param   none 
*\*\return  none
**/
void FLASH_Prefetch_Buffer_Enable(void)
{
    /* Enable the Prefetch Buffer */
    FLASH->AC |= FLASH_PREFETCHBUF_EN;
}

/**
*\*\name    FLASH_Prefetch_Buffer_Disable
*\*\fun     Disables the Prefetch Buffer.
*\*\note    This function can be used for N32G430 devices.
*\*\param   none
*\*\return  none
**/
void FLASH_Prefetch_Buffer_Disable(void)
{
    /* Disable the Prefetch Buffer */
    FLASH->AC &= FLASH_PREFETCHBUF_DIS;
}

/**
*\*\name    FLASH_ICache_Reset
*\*\fun     ICache Reset.
*\*\note    This function can be used for N32G430 devices.
*\*\param   none
*\*\return  none
**/
void FLASH_ICache_Reset(void)
{
    /* ICache Reset */
    FLASH->AC |= FLASH_ICAHRST_MSK;
}

/**
*\*\name    FLASH_ICache_Enable
*\*\fun     Enables the iCache.
*\*\note    This function can be used for N32G430 devices.
*\*\param   none
*\*\return  none
**/
void FLASH_ICache_Enable(void)
{
    /* Enable the iCache */
    FLASH->AC |= FLASH_ICACHE_EN;
}

/**
*\*\name    FLASH_ICache_Disable
*\*\fun     Disables the iCache.
*\*\note    This function can be used for N32G430 devices.
*\*\param   none
*\*\return  none
**/
void FLASH_ICache_Disable(void)
{
    /* Disable the iCache */
    FLASH->AC &= FLASH_ICACHE_DIS;
}


/**
*\*\name    FLASH_ICache_Status_Get
*\*\fun     Get the iCache status.
*\*\note    This function can be used for N32G430 devices.
*\*\param   none
*\*\return  FlagStatus :
*\*\            - SET
*\*\            - RESET
**/
FlagStatus FLASH_ICache_Status_Get(void)
{
    if ((FLASH->AC & FLASH_AC_ICAHEN) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}



/**
*\*\name   FLASH_Cache_LOCK_Start
*\*\fun    Start cache lock.
*\*\note   This function can be used for N32G430 devices.
*\*\param  lock_start_way :
*\*\            - FLASH_CAHR_LOCKSTRT_WAY0
*\*\            - FLASH_CAHR_LOCKSTRT_WAY1
*\*\            - FLASH_CAHR_LOCKSTRT_WAY2
*\*\            - FLASH_CAHR_LOCKSTRT_WAY3
*\*\return none
**/
void FLASH_Cache_LOCK_Start(uint32_t lock_start_way)
{
    FLASH->CAHR &= (~(lock_start_way << FLASH_CAHR_LOCK_OFFSET));
    FLASH->CAHR |= lock_start_way;
}

/**
*\*\name   FLASH_Cache_LOCK_Stop
*\*\fun    Stop cache lock.
*\*\note   This function can be used for N32G430 devices.
*\*\param  lock_stop_way :
*\*\            - FLASH_CAHR_LOCKSTOP_WAY0
*\*\            - FLASH_CAHR_LOCKSTOP_WAY1
*\*\            - FLASH_CAHR_LOCKSTOP_WAY2
*\*\            - FLASH_CAHR_LOCKSTOP_WAY3
*\*\return none
**/
void FLASH_Cache_LOCK_Stop(uint32_t lock_stop_way)
{
    FLASH->CAHR |= lock_stop_way;
}


/**
*\*\name   FLASH_Cache_LOCK_Cancel
*\*\fun    Cancle cache lock.
*\*\note   This function can be used for N32G430 devices.
*\*\param  lock_stop_way :
*\*\            - FLASH_CAHR_LOCKSTOP_WAY0
*\*\            - FLASH_CAHR_LOCKSTOP_WAY1
*\*\            - FLASH_CAHR_LOCKSTOP_WAY2
*\*\            - FLASH_CAHR_LOCKSTOP_WAY3
*\*\return none
**/
void FLASH_Cache_LOCK_Cancel(uint32_t lock_stop_way)
{
    FLASH->CAHR |= lock_stop_way;
    FLASH->CAHR &= (~lock_stop_way);
}

/**
*\*\name   FLASH_Cache_LOCK_Status_Get
*\*\fun    Get cache lock status.
*\*\note   This function can be used for N32G430 devices.
*\*\param  lock_way :
*\*\            - FLASH_CAHR_LOCKSTRT_WAY0
*\*\            - FLASH_CAHR_LOCKSTRT_WAY1
*\*\            - FLASH_CAHR_LOCKSTRT_WAY2
*\*\            - FLASH_CAHR_LOCKSTRT_WAY3
*\*\            - FLASH_CAHR_LOCKSTOP_WAY0
*\*\            - FLASH_CAHR_LOCKSTOP_WAY1
*\*\            - FLASH_CAHR_LOCKSTOP_WAY2
*\*\            - FLASH_CAHR_LOCKSTOP_WAY3
*\*\return  FlagStatus :
*\*\            - SET
*\*\            - RESET
**/
FlagStatus FLASH_Cache_LOCK_Status_Get(uint32_t lock_way)
{
    if ((FLASH->CAHR & lock_way) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}



/**
*\*\name   FLASH_Unlock
*\*\fun    Unlocks the FLASH Program Erase Controller.
*\*\note   This function can be used for N32G430 devices.
*\*\param  none
*\*\return none
**/
void FLASH_Unlock(void)
{
    FLASH->KEY = FLASH_KEY1;
    FLASH->KEY = FLASH_KEY2;
}

/**
*\*\name   FLASH_Lock
*\*\fun    Locks the FLASH Program Erase Controller.
*\*\note   This function can be used for N32G430 devices.
*\*\param  none
*\*\return none
**/
void FLASH_Lock(void)
{
    FLASH->CTRL |= FLASH_CTRL_SET_LOCK;
}


/**
*\*\name   Option_Bytes_Unlock
*\*\fun    Unlocks the Option_Bytes Program Erase Controller.
*\*\note   This function can be used for N32G430 devices.
*\*\param  none
*\*\return none
**/
void Option_Bytes_Unlock(void)
{
    FLASH->OPTKEY = FLASH_KEY1;
    FLASH->OPTKEY = FLASH_KEY2;
}


/**
*\*\name   Option_Bytes_Lock
*\*\fun    Locks the Option_Bytes Program Erase Controller.
*\*\note   This function can be used for N32G430 devices.
*\*\param  none
*\*\return none
**/
void Option_Bytes_Lock(void)
{
    /* Set the FLASH_CTRL_SET_OPTWE Bit to lock */
    FLASH->CTRL &= (~FLASH_CTRL_SET_OPTWE);
}


/**
*\*\name   Option_Bytes_Lock_Status_Get
*\*\fun    Get the Option Bytes lock status.
*\*\note   This function can be used for N32G430 devices.
*\*\param  none
*\*\return FlagStatus :
*\*\            - SET
*\*\            - RESET
**/
FlagStatus Option_Bytes_Lock_Status_Get(void)
{
    if ((FLASH->CTRL & FLASH_CTRL_SET_OPTWE) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}


/**
*\*\name   FLASH_One_Page_Erase
*\*\fun    Erases a specified FLASH page.
*\*\note   This function can be used for N32G430 devices.
*\*\param  page_address :
*\*\            - It ranges from 0x08000000 to 0x0800FFFF
*\*\return FLASH_STS : 
*\*\            - FLASH_BUSY
*\*\            - FLASH_ERR_PG 
*\*\            - FLASH_ERR_WRP
*\*\            - FLASH_EOP
*\*\            - FLASH_TIMEOUT
**/
FLASH_STS FLASH_One_Page_Erase(uint32_t page_address)
{
    FLASH_STS status_value = FLASH_EOP;

   /* Clears the FLASH's pending flags */
    FLASH_Flag_Status_Clear(FLASH_STS_CLRFLAG);
    /* Wait for last operation to be completed */
    status_value = FLASH_Last_Operation_Wait(ERASE_TIMEOUT);

