SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_flash.c
    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_Read_Out_Protection_L2_Status_Get() != RESET)
    {
        return FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }

    Option_Bytes_Unlock();

    /* Clears the FLASH's pending flags */
    FLASH_Flag_Status_Clear(FLASH_STS_CLRFLAG);
    /* Wait for last operation to be completed */
    status_value = FLASH_Last_Operation_Wait(ERASE_TIMEOUT);

    if (status_value == FLASH_EOP)
    {
        /* Enable the Option Bytes Programming operation */
        FLASH->CTRL |= FLASH_CTRL_SET_OPTPG;
        /* Restore the last read protection Option Byte value */
        OBT->USER_RDP =
            (uint32_t)option_byte_rpd1
            | (((uint32_t)(option_byte_iwdg | option_byte_stop | option_byte_stdby | option_byte_iwdg_stop0 
            | option_byte_iwdg_stop2 | option_byte_iwdg_stdby | option_byte_iwdg_sleep)) << FLASH_USER_RPD_OFFSET);
        
        /* Wait for last operation to be completed */
        status_value = FLASH_Last_Operation_Wait(PROGRAM_TIMEOUT);
        if (status_value != FLASH_TIMEOUT)
        {
            /* if the program operation is completed, disable the OPTPG Bit */
            FLASH->CTRL &= FLASH_CTRL_RESET_OPTPG;
        }
        else
        {
            /*No process*/
        }
    }
    else
    {
        /*No process*/
    }

    /* Return the Option Byte program status_value */
    return status_value;
}


/**
*\*\name   FLASH_Option_Bytes_DATA_Program
*\*\fun    Programs a half word at a specified Option Byte Data0 and Data1.
*\*\note   This function can be used for N32G430 devices.
*\*\param  option_byte_data0:
*\*\                - 0x00 to 0xFF
*\*\param  option_byte_data1:
*\*\                - 0x00 to 0xFF
*\*\return FLASH_STS: The returned value can be: 
*\*\                - FLASH_BUSY
*\*\                - FLASH_ERR_PG
*\*\                - FLASH_ERR_WRP
*\*\                - FLASH_EOP
*\*\                - FLASH_ERR_RDP2
*\*\                - FLASH_TIMEOUT
**/
FLASH_STS FLASH_Option_Bytes_DATA_Program(uint8_t option_byte_data0,uint8_t option_byte_data1)
{
    FLASH_STS status_value = FLASH_EOP;
 
    /* Clears the FLASH's pending flags */
    FLASH_Flag_Status_Clear(FLASH_STS_CLRFLAG);
    /* Wait for last operation to be completed */
    status_value = FLASH_Last_Operation_Wait(PROGRAM_TIMEOUT);

    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_Read_Out_Protection_L2_Status_Get() != RESET)
    {
        return FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }

    if (status_value == FLASH_EOP)
    {
        Option_Bytes_Unlock();
        /* Enables the Option Bytes Programming operation */
        FLASH->CTRL |= FLASH_CTRL_SET_OPTPG;
        OBT->Data1_Data0 = (((uint32_t)option_byte_data1) << FLASH_DATA0_DATA1_OFFSET) \
                          | ((uint32_t)option_byte_data0);

        /* Wait for last operation to be completed */
        status_value = FLASH_Last_Operation_Wait(PROGRAM_TIMEOUT);
        if (status_value != FLASH_TIMEOUT)
        {
            /* if the program operation is completed, disable the OPTPG Bit */
            FLASH->CTRL &= FLASH_CTRL_RESET_OPTPG;
        }
        else
        {
            /*No process*/
        }
    }
    else
    {
        /*No process*/
    }
    /* Return the Option Byte Data Program status_value */
    return status_value;
}

/**
*\*\name   FLASH_Write_Protection_Enable
*\*\fun    Write protects the desired pages
*\*\note   This function can be used for N32G430 devices.
*\*\param  flash_pages :
*\*\        - FLASH_WRP_Pages0to1
*\*\        - FLASH_WRP_Pages2to3
*\*\        - FLASH_WRP_Pages4to5
*\*\        - FLASH_WRP_Pages6to7
*\*\        - FLASH_WRP_Pages8to9
*\*\        - FLASH_WRP_Pages10to11
*\*\        - FLASH_WRP_Pages12to13
*\*\        - FLASH_WRP_Pages14to15
*\*\        - FLASH_WRP_Pages16to17
*\*\        - FLASH_WRP_Pages18to19
*\*\        - FLASH_WRP_Pages20to21
*\*\        - FLASH_WRP_Pages22to23
*\*\        - FLASH_WRP_Pages24to25
*\*\        - FLASH_WRP_Pages26to27
*\*\        - FLASH_WRP_Pages28to29
*\*\        - FLASH_WRP_Pages30to31
*\*\        - FLASH_WRP_AllPages
*\*\return FLASH_STS : 
*\*\        - FLASH_BUSY
*\*\        - FLASH_ERR_PG 
*\*\        - FLASH_ERR_WRP
*\*\        - FLASH_EOP
*\*\        - FLASH_ERR_RDP2
*\*\        - FLASH_TIMEOUT
**/
FLASH_STS FLASH_Write_Protection_Enable(uint32_t flash_pages)
{
    uint16_t WRP0_Data = 0xFFFF, WRP1_Data = 0xFFFF;

    FLASH_STS status_value = FLASH_EOP;

    /* Get the actual read protection L2 Option Byte value */
    if (FLASH_Read_Out_Protection_L2_Status_Get() != RESET)
    {
        return FLASH_ERR_RDP2;
    }
    else
    {
        /*No process*/
    }

    flash_pages = (uint32_t)(~flash_pages);
    WRP0_Data   = (uint16_t)( flash_pages & FLASH_WRP0_MSK);
    WRP1_Data   = (uint16_t)((flash_pages & FLASH_WRP1_MSK) >> FLASH_WRP_WRP1_OFFSET);

    /* Clears the FLASH's pending flags */
    FLASH_Flag_Status_Clear(FLASH_STS_CLRFLAG);
    /* Wait for last operation to be completed */
    status_value = FLASH_Last_Operation_Wait(PROGRAM_TIMEOUT);

    if (status_value == FLASH_EOP)
    {
        Option_Bytes_Unlock();
        FLASH->CTRL |= FLASH_CTRL_SET_OPTPG;

        if ((WRP0_Data != 0xFF) || (WRP1_Data != 0xFF))
        {
            OBT->WRP1_WRP0 = (((uint32_t)WRP0_Data) | (((uint32_t)WRP1_Data) << FLASH_WRP1_DATA_OFFSET));

            /* Wait for last operation to be completed */
            status_value = FLASH_Last_Operation_Wait(PROGRAM_TIMEOUT);
        }
        else
        {
            /*No process*/
        }

        if (status_value != FLASH_TIMEOUT)
        {
            /* if the program operation is completed, disable the OPTPG Bit */
            FLASH->CTRL &= FLASH_CTRL_RESET_OPTPG;
        }
        else
        {
            /*No process*/
        }
    }
    else
    {
        /*No process*/
    }
    /* Return the write protection operation status_value */
    return status_value;
}


/**
*\*\name    FLASH_Option_Bytes_User2_RDP2_Program
*\*\fun     Programs the FLASH User2_RDP2 Option Byte: nBOOT0 / nBOOT1 / nSWBOOT0 / RDP2 .
*\*\note    This function can be used for N32G430 devices.
*\*\param  option_byte_rpd2 :
*\*\            - FLASH_OB_RDP2_ENABLE
*\*\            - FLASH_OB_RDP2_DISABLE
*\*\param   option_byte2_nBOOT0 :
*\*\            - FLASH_OB2_NBOOT0_SET Set nBOOT0
*\*\            - FLASH_OB2_NBOOT0_CLR Clear nBOOT0
*\*\param   option_byte2_nBOOT1 :
*\*\            - FLASH_OB2_NBOOT1_SET Set nBOOT1
*\*\            - FLASH_OB2_NBOOT1_CLR Clear nBOOT1
*\*\param   option_byte2_nSWBOOT0 :
*\*\            - FLASH_OB2_NSWBOOT0_SET Set nSWBOOT0
*\*\            - FLASH_OB2_NSWBOOT0_CLR Clear nSWBOOT0
*\*\return  FLASH_STS : 
*\*\            - FLASH_BUSY
*\*\            - FLASH_ERR_PG 
*\*\            - FLASH_ERR_WRP
*\*\            - FLASH_EOP
*\*\            - FLASH_ERR_RDP2
*\*\            - FLASH_TIMEOUT
**/
FLASH_STS FLASH_Option_Bytes_User2_RDP2_Program(uint8_t option_byte_rpd2,uint8_t option_byte2_nBOOT0, \
                                                uint8_t option_byte2_nBOOT1, uint8_t option_byte2_nSWBOOT0)
{
    FLASH_STS status_value = FLASH_EOP;

